/* ================ Clavier.cpp ===========================================
** ELE-400 MÉTHODOLOGIE DE DESIGN EN GÉNIE ÉLECTRIQUE
** HIVER 2015
** Ecole de Technologie Supérieure
** ========================================================================

				TEAM:	PopeyeFcuSolutions

** ========================================================================
** REALISATION: Controleur de FCU
** ========================================================================
** Writen by: Francis Bergin
** ========================================================================
** Description: List of fonctions to control the keypad model FMBN16BD
** ======================================================================== */



/* ========================================================================
** Include files
** ======================================================================== */

#include "Clavier.h"


/* ========================================================================
** Global variables
** ======================================================================== */

char keys[ROWS][COLS] = {
    {'1','2','3','m'},
    {'4','5','6','o'},
    {'7','8','9','s'},
    {'g','0','d','e'}
};
byte rowPins[ROWS] = {kpPin1, kpPin2, kpPin3, kpPin4}; //connect to the row pinouts of the keypad
byte colPins[COLS] = {kpPin5, kpPin6, kpPin7, kpPin8}; //connect to the column pinouts of the keypad

Keypad keypad = Keypad( makeKeymap(keys), rowPins, colPins, ROWS, COLS );


/* ========================================================================
** Fonctions
** ======================================================================== */

/* ------------------------------------------------------------------------
** name: kpGetValue
** ------------------------------------------------------------------------
** input: none
** output: char of key pressed
** ------------------------------------------------------------------------
** Description: return the key pressed
** ------------------------------------------------------------------------ */
char kpGetValue(void)
{
    return keypad.getKey();
}
